blog/2019/07/28/merge-two-git-repo/index.html
<!DOCTYPE html>
<html lang="en-us">
  <head>
    <title>合并两个git仓库，并保留两个仓库的commit记录 - 小蜗牛的大梦想</title>
    <meta charset="utf-8" />
    <meta name="author" content="han1475" />
    <meta name="description" content="合并两个git仓库，并保留两个仓库的commit记录" />
    <meta name="keywords" content="git,merge,repo" />
    <link rel="icon" href="/assets/everding.ico" type="image/x-icon" />
    <link rel="shortcut icon" href="/assets/everding.ico" type="image/x-icon" />
    <link rel="stylesheet" href="/media/bootstrap-3.3.6-dist/css/bootstrap.min.css" type="text/css">
	<link rel="stylesheet" href="/media/css/prettify-solarized-light.css" type="text/css">
	<link rel="stylesheet" href="/media/css/bootstrap-toc.min.css" type="text/css">
	<link rel="stylesheet" href="/media/css/main.css" type="text/css">
	<link rel="stylesheet" href="/media/css/posts.css" type="text/css">
	<link rel="stylesheet" href="/media/css/dmx.css" type="text/css">
	<link rel="stylesheet" href="/media/css/asciinema-player.css" type="text/css">
  </head>

  <body class="container">
  <header class="navbar navbar-static-top bs-docs-nav">
	  <nav class="navbar navbar-default navbar-fixed-top">
	  <div class="container-fluid">
		  <!-- Brand and toggle get grouped for better mobile display -->
		  <div class="navbar-header">
			  <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-example-navbar-collapse-1" aria-expanded="false">
				  <!--<span class="sr-only">Toggle navigation</span>-->
				  <!--<span class="icon-bar"></span>-->
				  <!--<span class="icon-bar"></span>-->
				  <!--<span class="icon-bar"></span>-->
			  </button>
			  <a class="navbar-brand" href="/">小蜗牛的大梦想</a>
		  </div>
		  <!-- Collect the nav links, forms, and other content for toggling -->
		  <div class="collapse navbar-collapse" id="bs-example-navbar-collapse-1">
			  <ul class="nav navbar-nav navbar-right" data-smartmenus-id="smartmenus-dmx">
				  <li class="dmx-menu-item"><a href="/">Home</a></li>
				  
				  <li class="dmx-menu-item"><a href="/blog/">Blog</a></li>
				  
				  <li class="dmx-menu-item"><a href="/tags/">Tags</a></li>
				  <li class="dmx-menu-item"><a href="/about/">About</a></li>
				  <li class="dmx-menu-item"><a href="https://github.com/han1475">Github</a></li>
				  <li class="dmx-menu-item"><a href="/rss.xml">Rss</a></li>
			  </ul>
		  </div><!-- /.navbar-collapse -->
	  </div>
	  </nav>
  </header>

<div>
<div class="container center-block">
	<div class="col-md-1"></div>
	<div class="col-md-10 col-sm-12">
		
			<h1>合并两个git仓库，并保留两个仓库的commit记录</h1>
		
		
<div id="outline-container-org816e5c1" class="outline-2">
<h2 id="org816e5c1">说明</h2>
<div class="outline-text-2" id="text-org816e5c1">
<p>
将repo1合并到repo2中，并保留repo1的commit记录.
</p>
</div>
</div>
<div id="outline-container-org2919ec7" class="outline-2">
<h2 id="org2919ec7">在repo2中依次运行下列命令</h2>
<div class="outline-text-2" id="text-org2919ec7">
<pre class="example">
git remote add other /your/path/to/repo1
git fetch other
git checkout -b repo1 other/master
git checkout master
git merge repo1 --allow-unrelated-histories
</pre>
</div>
<div id="outline-container-org983de84" class="outline-3">
<h3 id="org983de84">为解决合并仓库时出现的fatal: refusing to merge unrelated histories错误，我们这里使用了--allow-unrelated-histories选项。</h3>
</div>
<div id="outline-container-org8d9f97c" class="outline-3">
<h3 id="org8d9f97c">合并仓库时和常规merge一致需处理合并冲突。</h3>
</div>
</div>

	</div>
	<div class="col-md-1" id="maybe-toc"></div>
</div>
</div>

	<div>
	  
	  <section>
		<div class="post-meta text-center">
			<span title="post date" class="label label-default">2019-07-28</span>
			<span title="last modification date" class="label label-success">2019-07-29</span>
			<span title="tags" class="label label-info"><a href="/tags/git/">git</a></span>
			<span title="author" class="label label-info">han1475</span>
		</div>
	  </section>
	  
	  
	  <section>
		<h1>Comments</h1>
		
		
	  </section>
	  
	  <script src="/media/js/prettify.r298.min.js"></script>
	  <!-- <script src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script> -->
	  <script src="/media/js/jquery-2.1.3.min.js"></script>
	  <script src="/media/js/main.js"></script>
	  <script src="/media/js/jquery.tagcanvas.min.js"></script>
	  <script src="/media/js/maketagcloud.js"></script>
	  
	  <footer class="footer">
		  <div class="container center-block">
			  <div class="row">
				  <div class="col-md-2"> </div>
				  <div class="col-md-8 col-sm-12">
					  <p class="text-center">Generated by <a href="http://www.gnu.org/software/emacs/">Emacs</a> 26.x (<a href="http://orgmode.org">Org mode</a> 9.x)</p>
					  <p class="text-center">
						  Copyright &copy; 2012 - <span id="footerYear"></span> <a href="mailto:me &lt;at&gt; han1475 &lt;dot&gt; com">han1475</a>
						  &nbsp;&nbsp;-&nbsp;&nbsp;
						  Powered by <a href="https://github.com/dingmingxin/org-page" target="_blank">org-page</a>
						  <script type="text/javascript">document.getElementById("footerYear").innerHTML = (new Date()).getFullYear();</script>
					  </p>
				  </div>
				  <div class="col-md-2"> </div>
			  </div>
		  </div>
	  </footer>
	</div>

  </body>
</html>
